
<?php session_start(); ?>
<!DOCTYPE html>
<!--[if lt IE 7 ]><html class="ie ie6" lang="en"> <![endif]-->
<!--[if IE 7 ]><html class="ie ie7" lang="en"> <![endif]-->
<!--[if IE 8 ]><html class="ie ie8" lang="en"> <![endif]-->
<!--[if (gte IE 9)|!(IE)]><!--><html lang="en"> <!--<![endif]-->
<head>

    <!-- Basic Page Needs
  ================================================== -->
	<meta charset="utf-8">
	<title>О PHP</title>
	<meta name="description" content="Free Responsive Html5 Css3 Templates | Zerotheme.com">
	<meta name="author" content="https://www.zerotheme.com">
	
    <!-- Mobile Specific Metas
	================================================== -->
	<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
    <!-- CSS
	================================================== -->
  	<link rel="stylesheet" href="css/zerogrid.css">
	<link rel="stylesheet" href="css/style.css">
	
	<!-- Custom Fonts -->
    <link href="font-awesome/css/font-awesome.min.css" rel="stylesheet" type="text/css">
	
	
	<link rel="stylesheet" href="css/menu.css">
	<script src="js/jquery1111.min.js" type="text/javascript"></script>
	<script src="js/script.js"></script>
	
	<!-- Owl Carousel Assets -->
    <link href="owl-carousel/owl.carousel.css" rel="stylesheet">
	
	<!--[if lt IE 8]>
       <div style=' clear: both; text-align:center; position: relative;'>
         <a href="http://windows.microsoft.com/en-US/internet-explorer/Items/ie/home?ocid=ie6_countdown_bannercode">
           <img src="http://storage.ie6countdown.com/assets/100/images/banners/warning_bar_0000_us.jpg" border="0" height="42" width="820" alt="You are using an outdated browser. For a faster, safer browsing experience, upgrade for free today." />
        </a>
      </div>
    <![endif]-->
    <!--[if lt IE 9]>
		<script src="js/html5.js"></script>
		<script src="js/css3-mediaqueries.js"></script>
	<![endif]-->
	
</head>

<body>
	<div class="wrap-body">
		
		<?php include ("blocks/header.php");?>
		
		<!--////////////////////////////////////Container-->
		<section id="container">
			<div class="wrap-container">
				<!-----------------Content-Box-------------------->
				<article class="single-post zerogrid">
					<div class="row wrap-post"><!--Start Box-->
						<div class="entry-header">
							
							<h1 class="entry-title">PHP — один из популярных сценарных языков (наряду с JSP, Perl и языками, используемыми в ASP.NET)</h1>
						
						</div>
						<div class="post-thumbnail-wrap">
							<img src="images/single.jpeg">
						</div>
						<div class="entry-content">
							<div class="excerpt"><p>Популярность в области построения веб-сайтов определяется наличием большого набора встроенных средств и дополнительных модулей для разработки веб-приложений, а основные из них: 
</p></div>
							<p><ul>
	<li>Автоматическое извлечение POST- и GET-параметров, а также переменных окружения веб-сервера в предопределённые массивы;&nbsp;</li>
	<li>Взаимодействие с большим количеством различных систем управления базами данных через дополнительные модули (MySQL, MySQLi, SQLite, PostgreSQL, Oracle Database (OCI8), Microsoft SQL Server, Sybase, ODBC, mSQL, IBM DB2, Cloudscape и Apache Derby, Informix, Ovrimos SQL, Lotus Notes, DB++, DBM, dBase, DBX, FrontBase, FilePro, Ingres II, SESAM, Firebird и InterBase, Paradox File Access, MaxDB, интерфейс PDO, Redis);&nbsp;</li>
	<li>Автоматизированная отправка HTTP-заголовков;&nbsp;</li>
	<li>Работа с HTTP-авторизацией;&nbsp;</li>
	<li>Работа с cookies и сессиями;&nbsp;</li>
	<li>Работа с локальными и удалёнными файлами, сокетами;&nbsp;</li>
	<li>Обработка файлов, загружаемых на сервер;&nbsp;</li>
	<li>Работа с XForms.&nbsp;</li>
	<li>Создание и работа с API&nbsp;</li>
	<li>Создание приложение с графическим интерфейсом пользователя при использовании Фреймворка Qt Designer&nbsp;</li>
	<li>Создание консольных приложений<br />
	&nbsp;</li>
</ul>
</p>
							<blockquote><p>Входит в LAMP — распространённый набор ПО для создания и хостинга веб-сайтов (Linux, Apache, MySQL, PHP), а также LEMP - не менее распространённый набор ПО (Linux, Nginx, MySql, PHP). 
Среди сайтов, использующих PHP — Facebook, Wikipedia, Yahoo!, Baidu. 
</p></blockquote>
							
							<h2>История PHP</h2>
							<p><p>В 1994 году датский программист Расмус Лердорф разработал на C[16] набор CGI-скриптов для учёта посетителей его онлайн-резюме, обрабатывающий шаблоны HTML-документов. Лердорф назвал набор Personal Home Page Tools (Инструменты для личной домашней страницы). Вскоре функциональности перестало хватать, и Лердорф разработал новый интерпретатор шаблонов PHP/FI (англ.&nbsp;Personal Home Page / Forms Interpreter&nbsp;&mdash; &laquo;персональная домашняя страница / интерпретатор форм&raquo;)[17].&nbsp;<br />
8 июня 1995 года вышел Personal Home Page (PHP Tools) version 1.0&nbsp;&mdash; первый публичный релиз.&nbsp;<br />
В 1997 году после длительного бета-тестирования вышла вторая версия обработчика, написанного на C&nbsp;&mdash; PHP/FI 2.0. Её использовали около 1&nbsp;% (приблизительно 50 тысяч) всех интернет-доменов мира[11].&nbsp;<br />
Версия PHP 3.0 подверглась значительной переработке, определившей современный облик и стиль языка программирования. В 1997 году два израильских программиста, Энди Гутманс и Зеев Сураски, полностью переписали код интерпретатора. PHP 3.0 был официально выпущен в июне 1998 года[11].&nbsp;<br />
Одной из сильнейших сторон PHP 3.0 была возможность расширения ядра дополнительными модулями. Впоследствии интерфейс написания расширений привлёк к PHP множество сторонних разработчиков, работающих над своими модулями, что дало PHP возможность работать с огромным количеством баз данных, протоколов, поддерживать большое число API. Большое количество разработчиков привело к быстрому развитию языка и стремительному росту его популярности. С этой версии акроним php расшифровывается как &laquo;PHP: hypertext Preprocessor&raquo;, вместо устаревшего &laquo;Personal Home Page&raquo;.&nbsp;<br />
К зиме 1998 года, практически сразу после официального выхода PHP 3.0, Энди Гутманс и Зеев Сураски начали переработку ядра PHP. В задачи входило увеличение производительности сложных приложений и улучшение модульности базиса кода PHP. Новый движок, названный Zend Engine, успешно справлялся с поставленными задачами и впервые был представлен в середине 1999 года. PHP 4.0, основанный на этом движке и принёсший с собой набор дополнительных функций, официально вышел в мае 2000 года. В дополнение к улучшению производительности, PHP 4.0 имел ещё несколько ключевых нововведений, таких как поддержка сессий, буферизация вывода, более безопасные способы обработки вводимой пользователем информации и несколько новых языковых конструкций.&nbsp;<br />
Пятая версия PHP была выпущена разработчиками 13 июля 2004 года. Изменения включают обновление ядра Zend (Zend Engine 2), что существенно увеличило эффективность интерпретатора. Введена поддержка языка разметки XML. Полностью переработаны функции ООП, которые стали во многом схожи с моделью, используемой в Java. В частности, введён деструктор, открытые, закрытые и защищённые члены и методы, окончательные члены и методы, интерфейсы и клонирование объектов. В последующих версиях также были введены пространства имён, замыкания и целый ряд достаточно серьёзных изменений, количественно и качественно сравнимых с теми, которые появились при переходе на PHP 5.0.&nbsp;<br />
Шестая версия PHP разрабатывалась с октября 2006 года[18]. Было сделано множество нововведений[19][20], как, например, исключение из ядра регулярных выражений POSIX и &laquo;длинных&raquo; суперглобальных массивов, удаление директив safe_mode, magic_quotes_gpc и register_globals из конфигурационного файла php.ini. Одним из основных новшеств должна была стать поддержка Юникода[21]. Однако в марте 2010 года разработка PHP6 была признана бесперспективной[22] из-за сложностей с поддержкой Юникода. Исходный код PHP6 перемещён на ветвь, а основной линией разработки стала версия 5.4<br />
PHP 7<br />
В 2014 году было проведено голосование, по результатам которого следующая версия получила название PHP 7[23]. Выход новой версии планировался в середине октября 2015 года[24]. В марте 2015 года Zend представили инфографику, в которой описаны основные нововведения PHP 7[25].&nbsp;<br />
3 декабря 2015&nbsp;года было объявлено о выходе PHP версии 7.0.0[26].&nbsp;<br />
Новая версия основывается на экспериментальной ветви PHP, которая изначально называлась phpng (англ.&nbsp;PHP Next Generation &laquo;следующее поколение&raquo;), и разрабатывалась с упором на увеличение производительности и уменьшение потребления памяти[27]. В новой версии добавлена возможность указывать тип возвращаемых из функции данных[28], добавлен контроль передаваемых типов для данных[29], а также новые операторы.&nbsp;<br />
13 июня 2019 вышла версия PHP 7.4. В ядро были добавлены типизированные свойства и стрелочные функции, а также ограниченная ковариантность возвращаемого типа и контравариантность типа аргумента[30<br />
PHP 8<br />
PHP версии 8.0 была выпущена 26 ноября 2020-го[31]. Главными нововведениями стали[32]: поддержка union-типов[33], JIT-компиляция[34] и атрибуты (также известны как аннотации), также &laquo;конструкция&raquo; switch была заменена на &laquo;выражение&raquo; match и был добавлен новый оператор Nullsafe.&nbsp;<br />
9 июля 2020 года Дэйл Хирт (англ.&nbsp;Dale Hirt), менеджер проекта PHP в Microsoft, в рассылке php.internals выпустил сообщение[35] о том, что после выпуска версии PHP 8.0 Microsoft прекратит поддержку разработки этого языка программирования для Windows[36]. Специалисты Microsoft занимались компиляцией бинарных версий интерпретатора для ОС Windows и тестированием их безопасности. В сообществе разработчиков PHP сообщили, что примут все необходимые меры, чтобы найти в ближайшее время альтернативный вариант для организации поддержки PHP 8.0 и выше для Windows, например, своими силами[37].&nbsp;</p>

<p><br />
PHP является языком программирования с динамической типизацией, не требующим указания типа при объявлении переменных, равно как и самого объявления переменных.&nbsp;<br />
&nbsp;</p>
</p>
					</div>
    </div>
    </article>		

		<!--////////////////////////////////////Footer-->
		<?php include ("blocks/footer.php");?>
	</div>
</body>
</html>